#!/usr/bin/env ruby
# -*- coding: utf-8 -*-
################################################################################
# $Date$
# $Id$
# $Version: 0.1$
# $Revision: 6$
# $Author: Victor |Stalker| Skurikhin <stalker@quake.ru>$
################################################################################
# Какую из двух костей из условия предыдущей задачи следует выбрать, чтобы с
# большей вероятностью получить больше очков? В качестве ответа введите максимум
# из дисперсий выигрышей.
#
# Ответ дайте с точностью до 10−3.

var_n = (1**2+2**2+3**2+4**2+5**2+6**2).to_f/6-(1*1.0/6+2*1.0/6+3*1.0/6+4*1.0/6+5*1.0/6+6*1.0/6)**2
var_a = (1**2+1**2+1**2+6**2+6**2+6**2).to_f/6-(1*1.0/6+1*1.0/6+1*1.0/6+6*1.0/6+6*1.0/6+6*1.0/6)**2

p 3*var_n
p 3*var_a
__END__
################################################################################
# vim: syntax=ruby:fileencoding=utf-8:fileformat=unix:tw=78:ts=2:sw=2:sts=2:et
# EOF
