#!/usr/bin/env ruby
# -*- coding: utf-8 -*-
################################################################################
# $Date$
# $Id$
# $Version: 0.1$
# $Revision: 4$
# $Author: Victor |Stalker| Skurikhin <stalker@quake.ru>$
################################################################################
# Сколько существует трехзначных чисел в пятеричной системе счисления, в
# которых все три цифры различны?
#

count = 0
(25...125).each {|i|
  f = i.to_s(5)
  if f[0] != f[1] and f[1] != f[2] and f[0] != f[2]
    count += 1
  end
}
p count
__END__
################################################################################
# vim: syntax=ruby:fileencoding=utf-8:fileformat=unix:tw=78:ts=2:sw=2:sts=2:et
# EOF
