#!/usr/bin/env ruby
# -*- coding: utf-8 -*-
################################################################################
# $Date$
# $Id$
# $Version: 0.1$
# $Revision: 6$
# $Author: Victor |Stalker| Skurikhin <stalker@quake.ru>$
################################################################################
# Восемь шаров, пронумерованных числами 0, 1, 1, 2, 2, 2, 5 и 10, помещены в
# урну. Экспериментатор вытягивает три из них и считает сумму чисел на вытянутых
# шарах. Каково математическое ожидание этой суммы? 
#
# Ответ дайте с точностью до 10−3.

a = [0, 1, 1, 2, 2, 2, 5, 10]
i = [1, 2, 3, 4, 5, 6, 7, 8]

c = 0
s = 0
i.combination(3) { |ic|
  c += 1
  s += a[ic[0]-1] + a[ic[1]-1] + a[ic[2]-1]
}
p s.to_f/c

__END__
################################################################################
# vim: syntax=ruby:fileencoding=utf-8:fileformat=unix:tw=78:ts=2:sw=2:sts=2:et
# EOF
